In [3]:
import sqlite3 as sqlite
import pandas as pd
from sqlalchemy import create_engine

In [4]:
with sqlite.connect('population.db') as con:
    cur = con.cursor()    
    cur.execute("CREATE TABLE IF NOT EXISTS Population(id INTEGER PRIMARY KEY, country TEXT, population INT)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Germany',81197537)")
    cur.execute("INSERT INTO Population VALUES(NULL,'France', 66415161)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Italy', 60795612)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")

In [5]:
connection = create_engine('sqlite:///population.db') # CONNECT

## reading sql data with pandas

### 1) read_sql_query()

In [8]:
sql = "SELECT * FROM Population"
with create_engine("sqlite:///population.db").connect() as con:
    df = pd.read_sql_query(sql, con)
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

### 2) read_sql_table()

In [11]:
table = "Population"

with create_engine("sqlite:///population.db").connect() as con:
    df = pd.read_sql_table(table, con)
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

### 3) read_sql()

In [12]:
sql = 'SELECT * FROM Population'

with create_engine('sqlite:///population.db').connect() as con:
    df = pd.read_sql(sql, con)
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

In [13]:
table = 'Population'

with create_engine('sqlite:///population.db').connect() as con:
    df = pd.read_sql(table, con)
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864